In [59]:
import pandas as pd

In [60]:
path = "/Users/rubenfilipemartinsdarocha/Library/CloudStorage/GoogleDrive-rubenfilype@gmail.com/My Drive/Colab Notebooks/Data_Science/2.Semestre/01.Text_Mining/04.Trabalho/Datasets/Tweets_EN_sentiment_train.csv"
df = pd.read_csv(path)

In [61]:
df.head()

        tweet                                               text class
0  1229448571                  some count sheep, you count cats    pos
1  1230261573  We haven't been to Turning Stone in ages! Have...   pos
2  1228861415                                           What up    pos
3  1228489365                                          I'm good    pos
4  1229800235  I know, wonder if USER is going to buy an apar...   pos

In [62]:
colunas = df.columns.tolist()

print(f"shape: {df.shape}\n")

for coluna in df.columns:
    num_linhas = df[coluna].shape[0]  
    valores_em_branco = df[coluna].isnull().sum()  
    tipo_de_dados = df[coluna].dtype  
    
    print(f"Coluna: {coluna}")
    print(f"  Número de linhas: {num_linhas}")
    print(f"  Valores em branco: {valores_em_branco}")
    print(f"  Tipo de dados: {tipo_de_dados}\n")

shape: (39936, 3)

Coluna: tweet
  Número de linhas: 39936
  Valores em branco: 0
  Tipo de dados: int64

Coluna: text
  Número de linhas: 39936
  Valores em branco: 235
  Tipo de dados: object

Coluna: class
  Número de linhas: 39936
  Valores em branco: 0
  Tipo de dados: object

In [63]:
# Distribuição das Classes

print(df['class'].value_counts())

class
pos    33065
neg     6871
Name: count, dtype: int64

In [64]:
valores_ausentes = df[df.isnull().any(axis=1)]
valores_ausentes

            tweet text class
468    1229613877  NaN   neg
620    1229815502  NaN   pos
733    1228500852  NaN   pos
879    1229218078  NaN   neg
1060   1230727494  NaN   pos
...           ...  ...   ...
39158  1229309579  NaN   neg
39227  1229027568  NaN   pos
39288  1224601475  NaN   neg
39362  1230226128  NaN   neg
39877  1230697072  NaN   neg

[235 rows x 3 columns]

In [68]:
num_valores_nan = df['text'].isnull().sum()
num_valores_nan

235

In [70]:
df_limpo = df.dropna(subset=['text'])
df_limpo

            tweet                                               text class
0      1229448571                  some count sheep, you count cats    pos
1      1230261573  We haven't been to Turning Stone in ages! Have...   pos
2      1228861415                                           What up    pos
3      1228489365                                          I'm good    pos
4      1229800235  I know, wonder if USER is going to buy an apar...   pos
...           ...                                                ...   ...
39931  1230130325                                    LOL- F, please    pos
39932  1229250927  I wish I could do that too! But it ain't happe...   neg
39933  1228710021                    I &lt;3 my boyfriend's family.    pos
39934  1228100681                                               404    neg
39935  1229022675  RT USER ok i can still tweet but admit i am a ...   pos

[39701 rows x 3 columns]

In [78]:
df['text'] = df['text'].astype(str)
df['text'] = df['text'].str.strip()

df_apenas_numeros = df[df['text'].str.match('^\d+$')]

df_apenas_numeros

            tweet text class
35339  1229561964    4   pos
39934  1228100681  404   neg